hazy1k/CW32-48L/2.开发环境/新建工程所要用到的库文件/Libraries/src/cw32l031_adc.c
    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns01;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk | ADC_SQR0_SQR1_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR2转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr02ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns02;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR3转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr03ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR4转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr04ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk, ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR5转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr05ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk,
                   (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR6转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr06ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr6Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk |\
                   ADC_SQR1_SQR6_Msk,
                   (ADC_SerialChStruct->ADC_Sqr6Chmux << ADC_SQR1_SQR6_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr6Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR7转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr07ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr6Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr7Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |\
                   ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |\
                   (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk |\
                   ADC_SQR1_SQR6_Msk | ADC_SQR1_SQR7_Msk,
                   (ADC_SerialChStruct->ADC_Sqr7Chmux << ADC_SQR1_SQR7_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr6Chmux << ADC_SQR1_SQR6_Pos) |\
                   (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |\
                   ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr6Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr7Chmux);
}
/**
 * @brief
 *          触发DMASOC读取命令
 *
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_DmaSocCmd(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE)
    {
        REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
    }
    else
    {
        REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
    }
}

/**
 * @brief
 *       触发DMASOC读取使能
 *
 */
void ADC_DmaSocEnable(void)
{
    REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
}

/**
 * @brief
 *       触发DMASOC读取禁止
 *
 */
void ADC_DmaSocDisable(void)
{
    REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
}

/**
 * @brief
 *          触发DMASOF读取命令
 *
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_DmaSofCmd(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE)
    {
        REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
    }
    else
    {
        REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
    }
}

/**
 * @brief
 *       触发DMASOF读取使能
 *
 */
void ADC_DmaSofEnable(void)
{
    REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
}

/**
 * @brief
 *       触发DMASOF读取禁止
 *
 */
void ADC_DmaSofDisable(void)
{
    REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
}

/**
 * @brief
 *          获取单次转换采样值
 *
 * @param
 *
 * @return uint16_t
 */
uint16_t ADC_GetConversionValue(void)
{
    return (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief
 *          获取SQR0通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr0Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief
 *          获取SQR1通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr1Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT1);
}

/**
 * @brief
 *          获取SQR2通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr2Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT2);
}

/**
 * @brief
 *          获取SQR3通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr3Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT3);
}

/**
 * @brief
 *          获取SQR4通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr4Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT4);
}

/**
 * @brief
 *          获取SQR5通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr5Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT5);
}

/**
 * @brief
 *          获取SQR6通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr6Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT6);
}

/**
 * @brief
 *          获取SQR7通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr7Result(uint16_t* pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT7);
}

/**
 * @brief
 *          获取累加采样值
 *
 * @param   pAdcAccResult
 */
void ADC_GetAccResult(uint32_t* pAdcAccResult)
{
    if (NULL == pAdcAccResult)
    {
        return;
    }

    *pAdcAccResult = (uint32_t)(CW_ADC->RESULTACC);
}

/**
 * @brief
 *          清零累加采样值
 */
void ADC_ClrAccResult(void)
{
    REGBITS_SET(CW_ADC->CR2, ADC_CR2_ACCRST_Msk);
}

/**
 * @brief
 *          设置ADC参考电压
 *
 * @param   ADC_VrefSel:
 *          @arg ADC_Vref_BGR1p5
 *          @arg ADC_Vref_BGR2p5
 *          @arg ADC_Vref_Extern1
 *          @arg ADC_Vref_VDDA
 */
void ADC_SetVref(uint32_t ADC_VrefSel)
{
    assert_param(IS_ADC_VREF_SEL(ADC_VrefSel ));

    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_REF_Msk,
                   ADC_VrefSel);
    if (ADC_VrefSel == ADC_Vref_Extern1)
    {
        //初始化ExRef：PB00
        REGBITS_SET( CW_SYSCTRL->AHBEN, SYSCTRL_AHBEN_GPIOB_Msk);//打开GPIO时钟
        PB00_ANALOG_ENABLE();
    }
}
/**
 * @brief
 *          设置ADC结果对齐方式
 *
 * @param   enAlign:
 *          @arg ADC_AlignRight
 *          @arg ADC_AlignLeft
 */
void ADC_SetAlign(uint32_t enAlign)
{
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_ALIGN_Msk, enAlign);
}

/**
 * @brief
 *        设置单通道ADC转换结果溢出保存策略
 *
 * @param enDiscard:
 *        @arg ADC_DiscardNull
 *        @arg ADC_DiscardEnable
 */
void ADC_SetDiscard(uint32_t enDiscard)
{
    assert_param(IS_ADC_DATA_DISCARD(enDiscard));
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DISCARD_Msk, enDiscard);
}

/**
 * @brief
 *        设置内置温度传感器使能控制
 *
 * @param enTs:
 *        @arg ADC_TsDisable
 *        @arg ADC_TsEnable
 */
void ADC_SetTs(uint32_t enTs)
{
    assert_param(IS_ADC_TS_ENABLE(enTs));
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_TSEN_Msk, enTs);

